БИТУправление_медицинским_центром_демо/src/Catalogs/ВычисляемыеЗначенияПараметров/ВычисляемыеЗначенияПараметров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВычисляемыеЗначенияПараметров</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлгоритмВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательВычисляемогоЗначения</name>
    <type>
      <types>EnumRef.ПолучателиВычисляемогоЗначения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПеременных</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приемник</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеРеквизиты</name>
    <comment>Реквизиты документа, при изменении которых требуется пересчитать параметры, использующие это вычисляемое значение</comment>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВычисляемыеЗначенияПараметров/Forms/ФормаВыбораУпр/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПолучательВычисляемогоЗначения", ПолучательВычисляемогоЗначения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование
		И ЗначениеЗаполнено(ПолучательВычисляемогоЗначения)
	Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ПолучательВычисляемогоЗначения", ПолучательВычисляемогоЗначения));
		ОткрытьФорму("Справочник.ВычисляемыеЗначенияПараметров.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
